{
  "sentences": [
    "What's something I said in the past that made you feel loved and appreciated?",
    "How can I make you feel supported when you're having a tough day, even from afar?",
    "If I could send you a care package right now, what would you want in it?",
    "What's your favorite memory of us together?",
    "How do you prefer to receive affection when we're not physically together?",
    "What's a song that always makes you think of me?",
    "Is there a small act I can do daily to remind you that you are on my mind?",
    "What’s your favorite message I've ever written to you?",
    "If I could do one chore or task for you right now, what would it be?",
    "What's a dream destination you’d love us to visit together?",
    "How important are surprise gifts to you in our relationship?",
    "What's something new you’d like us to try when we are together again?",
    "What words of affirmation do you find most meaningful?",
    "How do you feel about long video calls versus frequent texting?",
    "What's a book you’ve read recently that you’d love to discuss with me?",
    "If I could teleport to you for just an hour, what would we do?",
    "What's a hobby you'd like us to pick up together?",
    "What’s your favorite photo of us and why?",
    "How can I help you achieve a personal goal or dream?",
    "Do you have a favorite ‘good morning’ or ‘good night’ message from me?",
    "What's your favorite way to spend time together online?",
    "What's a small thing I do that makes you feel especially loved?",
    "Would you enjoy receiving handwritten letters?",
    "What's an upcoming date or event you're excited to celebrate together?",
    "How do you feel about planning future trips or activities together?",
    "What's your favorite comfort food that reminds you of me?",
    "Is there a movie you’ve been wanting to watch together?",
    "How can I make our chats, calls, and visits more special and romantic?",
    "What's a dream or aspiration you haven’t shared with me yet?",
    "What's something silly or quirky about me that you like?",
    "How can I be a better listener for you?",
    "What's a challenge you're currently facing that I can support you in?",
    "Do you have a favorite nickname for me?",
    "What's a skill or talent of mine that you admire?",
    "How do you feel about planning a virtual date night?",
    "What's your favorite way to relax and unwind, and how can I be a part of that?",
    "What's a tradition or routine you’d like us to start?",
    "How do you feel about sharing our daily routines with each other?",
    "What's a personal achievement you’re proud of recently?",
    "Do you have a specific love language you think I respond to best?",
    "What's your idea of a perfect day spent together?",
    "How can I make you feel more secure in our relationship?",
    "What's a topic you’ve always wanted to discuss with me but haven’t yet?",
    "Do you have a favorite outfit or style you love seeing me in?",
    "How can we keep our physical connection strong while we're apart?",
    "What's a fond childhood memory you’d like to share with me?",
    "What's something you'd like to learn about me that you don’t know yet?",
    "Do you have a favorite quote or saying that inspires you?",
    "What's something adventurous or out of the ordinary you want to try together?",
    "How do you envision our future together?"
  ]
}
